#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ ЗначениеЗаполнено(Выплаты) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнено ни одной строчки");
		Отказ = Истина;
		
	КонецЕсли;
	
	// регистр СЕК_ВзаиморасчетыССотрудниками Приход
	Движения.СЕК_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
		Движение = Движения.СЕК_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Подразделение = ТекСтрокаВыплаты.Подразделение;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗП() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СЕК_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	СЕК_ВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
	|	СЕК_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.СЕК_ВзаиморасчетыССотрудниками.Остатки КАК СЕК_ВзаиморасчетыССотрудникамиОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Всем всё выплачено!");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Строка = Выплаты.Добавить();
		Строка.Сотрудник = Выборка.Сотрудник;
		Строка.Подразделение = Выборка.Подразделение;
		Строка.Сумма = Выборка.СуммаОстаток;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли