
Функция PingGETPing(Запрос)
	
	Возврат СЕК_Телеграм.ПростойУспешныйОтвет();
	
КонецФункции

Функция SendPOSTSend(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени(); 
	
	Попытка
		Ответ = СЕК_Телеграм.ПростойУспешныйОтвет();
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ =  СЕК_Телеграм.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;	
	
	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("bots.send", НачалоЗамера);
	
	СЕК_Телеграм.ЗаписьЛога("send", Запрос, Ответ);
	
	Возврат Ответ;
	
КонецФункции
