
// {{ СЕК 16.03.24 Добавление в форму новых реквизитов в зависиости от Выбора в Виде договоров "Абонентское обслуживание" 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ОпределитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ОпределитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьЭлементов()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СЕК_АбонентскоеОбслуживание") Тогда
		
		Элементы.СЕК_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.СЕК_ДатаОкончанияДействияДоговора.Видимость = Истина;
		Элементы.СЕК_СтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
		Элементы.СЕК_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Истина;
	Иначе
		Объект.СЕК_ДатаНачалаДействияДоговора = Неопределено;
		Объект.СЕК_ДатаОкончанияДействияДоговора = Неопределено;
		Объект.СЕК_СтоимостьЧасаРаботыСпециалиста = Неопределено;
		Объект.СЕК_СуммаЕжемесячнойАбоненсткойПлаты = Неопределено;
		Элементы.СЕК_ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.СЕК_ДатаОкончанияДействияДоговора.Видимость = Ложь;
		Элементы.СЕК_СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
		Элементы.СЕК_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// СЕК 16.03.24 Конец добавления }}

 

